use UNIVER
--Task 3 (парсинг xml-документа)
declare @h int = 0,
@sbj varchar(3000) = N'<?xml version="1.0" encoding="windows-1251" ?>
                      <дисциплины>
					     <дисциплина код="КГиГsad" название="Компьютерная геометрия и графика" кафедра="ИСиТ" />
						 <дисциплина код="ОЗИasd" название="Основы защиты информации" кафедра="ИСиТ" />
						 <дисциплина код="МПasdп" название="Математическое программирование п" кафедра="ИСиТ" />
					  </дисциплины>';
exec sp_xml_preparedocument @h output, @sbj;
insert SUBJECT select[код], [название], [кафедра] from openxml(@h, '/дисциплины/дисциплина',0)
    with([код] char(10), [название] varchar(100), [кафедра] char(20));

select * from SUBJECT