use UNIVER
--Task 4 (добавление данных в формате XML)
insert into STUDENT(IDGROUP, NAME, BDAY, INFO) values(6, 'Ярмолик М.А.', '06.11.2001',
                                                          '<студент>
														     <паспорт серия="МС" номер="1234567" дата="01.01.1970" />
															 <телефон>375331001010</телефон>
															 <адрес>
															    <страна>Беларусь</страна>
																<город>Минск</город>
																<улица>Белорусская</улица>
																<дом>21</дом>
																<квартира>710</квартира>
															 </адрес>
														  </студент>');



select NAME[ФИО], INFO.value('(студент/паспорт/@серия)[1]', 'char(2)')[Серия паспорта],
	INFO.value('(студент/паспорт/@номер)[1]', 'varchar(20)')[Номер паспорта],
	INFO.query('/студент/адрес')[Адрес]
		from  STUDENT
			where NAME = 'Ярмолик М.А.';